package utils

// ErrCodeToDesc - errcode 对应的描述
var ErrCodeToDesc = map[int]string{
	0:     "成功",
	-1:    "系统繁忙，此时请开发者稍候再试",
	40001: "AppSecret错误或者AppSecret不属于这个公众号，请开发者确认AppSecret的正确性",
	40002: "请确保grant_type字段值为client_credential",
	40003: "传入非法的openid",
	40013: "传入非法的appid",
	40164: "调用接口的IP地址不在白名单中，请在接口IP白名单中进行设置。（小程序及小游戏调用不要求IP地址在白名单内。）",

	45056: "创建的标签数过多，请注意不能超过100个",
	45057: "该标签下粉丝数超过10w，不允许直接删除",
	45058: "不能修改0/1/2这三个系统默认保留的标签",

	45157: "标签名非法，请注意不能和其他标签重名",
	45158: "标签名长度超过30个字节",
	45159: "非法的tag_id",

	89503: "此IP调用需要管理员确认,请联系管理员",
	89501: "此IP正在等待管理员确认,请联系管理员",
	89506: "24小时内该IP被管理员拒绝调用两次，24小时内不可再使用该IP调用",
	89507: "1小时内该IP被管理员拒绝调用一次，1小时内不可再使用该IP调用",
}
